Project/Toir/src/DataProcessors/торо_ПанельАдминистрированияТОиР/торо_ПанельАдминистрированияТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПанельАдминистрированияТОиР</name>
</mdclass:DataProcessor>

Project/Toir/src/Documents/торо_ПринятиеОРКУчету/торо_ПринятиеОРКУчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПринятиеОРКУчету</name>
  <registerRecords>InformationRegister.торо_СтатусыОбъектовРемонтаВУчете</registerRecords>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВСостав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПодчиненныхПринятыхКУчету</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятьКУчету</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/DataProcessors/торо_ПанельАдминистрированияТОиР/Forms/ФормаПереходаКИспользованиюДокументовЖЦ/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОткрытаИзНастроек") Тогда
		ТекстСообщения = НСтр("es='Se puede abrir la forma si no se usaban antes los documentos de la aceptación y la amortización de los objetos de la reparación.';ru='Форму можно открыть если ранее не использовались документы принятия и списания объектов ремонта.';en='The form can be opened if documents for acceptance and cancellation of repair objects have not been used previously.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли; 
	
	Если Не Отказ Тогда
		ЗаполнитьДеревоОбъектовРемонта(Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновнаяОрганизация",
		Истина);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		
		Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР",
		"ОсновноеПодразделение",
		Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоОбъектовРемонта(Отказ)
	
	ОсновнаяИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	
	Если Не ЗначениеЗаполнено(ОсновнаяИерархия) Тогда
		ТекстСообщения = НСтр("en='The constant ""Hierarchy for entering new EI"" is not filled.';es='"".';ru='Не заполнена константа ""Иерархия для ввода новых ОР"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли; 
	
	МассивОР = Параметры.МассивОР;
	
	Для Индекс = 0 По МассивОР.ВГраница() Цикл
		НС = ТаблицаСОбъектамиРемонта.Добавить();
		НС.ОбъектРемонта = МассивОР[Индекс][0];
		НС.ДатаВводаВЭксплуатацию = МассивОР[Индекс][1];
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокументыПринятияКУчетуНаСервере(МассивОбъектов, Организация, Подразделение, ВсеДокументыСозданы)
	
	Ответственный = Пользователи.АвторизованныйПользователь();
	Комментарий   = "Документ создан системой при установке флага ""Использовать документы принятия и списания оборудования""";
	
	Для каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ОбъектРемонта          = ЭлементМассива.ОбъектРемонта;
		ДатаВводаВЭксплуатацию = ЭлементМассива.ДатаВводаВЭксплуатацию;
		
		ДокументОбъект = Документы.торо_ПринятиеОРКУчету.СоздатьДокумент();
		
		ДокументОбъект.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
		ДокументОбъект.ОбъектРемонта          = ОбъектРемонта;
		ДокументОбъект.Организация            = ?(ЗначениеЗаполнено(ОбъектРемонта.Организация), ОбъектРемонта.Организация, Организация);
		ДокументОбъект.Подразделение          = ?(ЗначениеЗаполнено(ОбъектРемонта.Подразделение), ОбъектРемонта.Подразделение, Подразделение);
		ДокументОбъект.Дата                   = ТекущаяДата();
		ДокументОбъект.Ответственный          = Ответственный;
		ДокументОбъект.Комментарий            = Комментарий;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ШаблонСообщения = НСтр("es='El objeto de la reparación <%1> es aceptado al recuento.';ru='Объект ремонта <%1> принят к учету.';en='Repair object <%1> accepted for accounting.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Исключение
			ШаблонСообщения = НСтр("es='No consiguió pasar el documento <la Aceptación del objeto de la reparación al recuento> para el objeto de la reparación <%1>';ru='Не удалось провести документ <Принятие объекта ремонта к учету> для объекта ремонта <%1>';en='Failed to post document <Принятие объекта ремонта к учету> for repair object <%1>'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ВсеДокументыСозданы = Ложь;
		КонецПопытки; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПринятияКУчету(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("es='>.';ru='Не заполнено поле <Организация>.';en='The <Организация> field is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Организация",, Отказ);
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ТекстСообщения = НСтр("es='>.';ru='Не заполнено поле <Подразделение>.';en='The <Подразделение> field is not filled.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Подразделение",, Отказ);
	КонецЕсли; 
	
	Если Не Отказ Тогда
		
		МассивСтруктур       = Новый Массив;
		ЭлементыТаблицы       = ТаблицаСОбъектамиРемонта;
		
		Для каждого СтрокаТаблицы Из ЭлементыТаблицы Цикл
			Если СтрокаТаблицы.Пометка = Истина Тогда
				Структура = Новый Структура("ОбъектРемонта, ДатаВВодаВЭксплуатацию", СтрокаТаблицы.ОбъектРемонта, СтрокаТаблицы.ДатаВВодаВЭксплуатацию);
				МассивСтруктур.Добавить(Структура);
			КонецЕсли;
		КонецЦикла; 
		
		ВсеДокументыСозданы = Истина;
		
		СоздатьДокументыПринятияКУчетуНаСервере(МассивСтруктур, Организация, Подразделение, ВсеДокументыСозданы);
		
		Если ВсеДокументыСозданы Тогда
			Закрыть();
		Иначе
			ТекстСообщения = НСтр("es='Para la parte de los objetos de la reparación no consiguió crear los documentos de la aceptación de los objetos de la reparación al recuento. "
"Corrijan las observaciones y repitan la tentativa.';ru='Для части объектов ремонта не удалось создать документы принятия объектов ремонта к учету."
"Исправьте замечания и повторите попытку.';en='For part of the repair facilities, it was not possible to create documents for acceptance of repair facilities for accounting."
"Correct the comments and try again.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаСОбъектамиРемонта Цикл
		СтрокаТабличнойЧасти.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаСОбъектамиРемонта Цикл
		СтрокаТабличнойЧасти.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаСОбъектамиРемонта Цикл
		СтрокаТабличнойЧасти.Пометка = (Не СтрокаТабличнойЧасти.Пометка);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
